In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d']=6

In [11]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
states = ['California','Ohio','Oregon','Texas']

In [21]:
obj4 = pd.Series(sdata,index=states)

In [22]:
obj4

California        NaN
Ohio              NaN
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
pd.isnull(obj4)

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj3+obj4

California         NaN
Ohio               NaN
Oregon         32000.0
Texas         142000.0
Utah               NaN
ohio               NaN
dtype: float64

In [27]:
obj4.name = 'population'

In [34]:
obj4.index.name = 'state'

In [35]:
obj4

state
California        NaN
Ohio              NaN
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index=['Bob','Steve']

ValueError: Length mismatch: Expected axis has 4 elements, new values have 2 elements

In [38]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [39]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [40]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [41]:
frame = pd.DataFrame(data)

In [42]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [43]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [44]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [47]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [48]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [49]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [50]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [52]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [53]:
frame2.loc['three']#使用loc函数进行行的选取

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [54]:
frame2['debt'] = 16.5

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [56]:
frame2['debt'] = np.arange(6.)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [58]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [59]:
frame2['debt']= val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [61]:
frame2['eastern']= frame2.state == 'Ohio'

In [62]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [63]:
del frame2['eastern']

In [64]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [65]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}} #外层键会作为列，内层的键作为行索引,内层的键会被合并排序以形成最终的索引

In [66]:
frame3 = pd.DataFrame(pop)

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [71]:
pd.DataFrame(pop,columns=['Nevada','Ohio'],index=[2001,2002,2003])#如果明确指明的话，则不会被合并

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [72]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [74]:
index = obj.index
index

Index(['Bob', 'Steve', 'Jeff', 'Ryan'], dtype='object')

In [76]:
index[:-1]

Index(['Bob', 'Steve', 'Jeff'], dtype='object')

In [77]:
index[1]='test'#index对象是不可变的

TypeError: Index does not support mutable operations

In [78]:
labels = pd.Index(np.arange(3))#不可变使得index在多个df之间共享变得简单

In [79]:
obj2 = pd.Series([1.6,-2.3,0],index=labels)
obj2

0    1.6
1   -2.3
2    0.0
dtype: float64

In [80]:
obj2.index is labels

True

In [81]:
1 in labels

True

In [83]:
obj = pd.Series([1,2,3,4,5],index = ['a','c','d','e','b'])
obj

a    1
c    2
d    3
e    4
b    5
dtype: int64

In [84]:
obj2 = obj.reindex(['a','b','c','d','e'])#会根据索引进行重新排序，如果不存在则引入缺失值
obj2

a    1
b    5
c    2
d    3
e    4
dtype: int64

In [85]:
obj3 = pd.Series(['blue','yellow','green'],index = [0,2,4])
obj3.reindex(range(6),method = 'ffill')#会使用后一项的值对前一项的空缺进行填补

0      blue
1      blue
2    yellow
3    yellow
4     green
5     green
dtype: object

In [86]:
#对于df，reindex默认修改行的索引，使用columns可以索引列
obj

a    1
c    2
d    3
e    4
b    5
dtype: int64

In [89]:
obj.drop('a')

c    2
d    3
e    4
b    5
dtype: int64

In [ ]:
#对于df，drop默认drop行索引，可以通过axis='columns'或者axis = 1来丢弃列索引

In [ ]:
#inplace参数可以将操作变成就地操作

In [92]:
#panda利用数值的切片和普通的切片是相同的，利用标签的切片则是左右皆为闭区间的
obj = obj.reindex(['a','b','c','d','e'])

In [96]:
obj['b':'d':2]

b    5
d    3
dtype: int64

In [97]:
obj[:2]

a    1
b    5
dtype: int64

In [99]:
#panda可以同过loc函数表明是轴标签或iloc表明是整数索引
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [104]:
frame.loc[[1,2],['year','pop']]

   year  pop
1  2001  1.7
2  2002  3.6

In [106]:
frame.loc[[1,2],'year'] #这是一个带name的series

   year
1  2001
2  2002

In [108]:
frame.loc[[1,2],['year']] #这是一个df

   year
1  2001
2  2002

In [109]:
frame.iloc[[0,1,2],1]

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [116]:
#当行索引包含整数的时候，这个时候数据的选取总是优先标签值而非索引序号值
obj = frame['year']

In [120]:
obj = obj.reindex(index = [3,2,1,5,4])

In [121]:
obj

3    2001
2    2002
1    2001
5    2003
4    2002
Name: year, dtype: int64

In [122]:
obj[1]

2001

In [143]:
#一些运算的fiil_value参数可以为缺失值设置默认值
frame1 = frame.reindex(index=[2,1,3,4,5])

In [145]:
frame1.loc[2,'pop'] = np.nan

In [152]:
frame1.loc[0] = pd.Series({'state':'Ohio','year':2001})

In [156]:
frame1.add(frame,fill_value=0.0)

          state  year  pop
0      OhioOhio  4001  1.5
1      OhioOhio  4002  3.4
2      OhioOhio  4004  3.6
3  NevadaNevada  4002  4.8
4  NevadaNevada  4004  5.8
5  NevadaNevada  4006  6.4

In [159]:
#使用apply方法可以将函数应用到frame的每一行，列等中，其参数中的x，就是每一行列或者元素
#df.apply(f) #保留列结构
#df.apply(f,axis='colums') #保留行结构
#df.applymap(f)
def f(x):
    return pd.Series([x[2]+x[1]],index = ['add'])
frame1.apply(f,axis='columns')

      add
2     NaN
1  2002.7
3  2003.4
4  2004.9
5  2006.2
0     NaN

In [160]:
frame1

    state  year  pop
2    Ohio  2002  NaN
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
0    Ohio  2001  NaN

In [162]:
frame1.sort_index(axis=0,ascending=False)

    state  year  pop
5  Nevada  2003  3.2
4  Nevada  2002  2.9
3  Nevada  2001  2.4
2    Ohio  2002  NaN
1    Ohio  2001  1.7
0    Ohio  2001  NaN

In [165]:
obj.sort_values()

3    2001
1    2001
2    2002
4    2002
5    2003
Name: year, dtype: int64

In [167]:
frame.sort_values(by=['year','pop'])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9
2    Ohio  2002  3.6
5  Nevada  2003  3.2

In [169]:
#排名函数rank可以计算出每个元素对应的排序
obj

3    2001
2    2002
1    2001
5    2003
4    2002
Name: year, dtype: int64

In [171]:
obj.rank()

3    1.5
2    3.5
1    1.5
5    5.0
4    3.5
Name: year, dtype: float64

In [173]:
#rank函数可以传入参数来控制升降序以及等值时如何分配
obj.rank(ascending=False,method='max')

3    5.0
2    3.0
1    5.0
5    1.0
4    3.0
Name: year, dtype: float64

In [174]:
#对于df的rank需要指定axis
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [175]:
frame.rank(axis='columns')

   year  pop
0   2.0  1.0
1   2.0  1.0
2   2.0  1.0
3   2.0  1.0
4   2.0  1.0
5   2.0  1.0

In [ ]:
# 当拥有重复标签的索引的时候，选取等函数的返回值会依据具体返回的数量有一定的区别

In [183]:
frame.loc[:,['year','pop']]

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [184]:
frame.loc[:,['year','pop']].sum()

year    12009.0
pop        15.3
dtype: float64

In [186]:
frame.loc[:,['year','pop']].idxmax()

year    5
pop     2
dtype: int64

In [187]:
frame.loc[:,['year','pop']].describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [192]:
frame['year'].unique()

array([2000, 2001, 2002, 2003], dtype=int64)

In [195]:
frame['year'].value_counts()

2002    2
2001    2
2003    1
2000    1
Name: year, dtype: int64